Repository: giellalt/corpus-fin
Catalog: prestable/tmx/fin2smn/admin/sd/www.samediggi.fi/index2.php_option=com_content_task=view_id=607_lang=finnish.html.tmx
Source language: fin
Languages: smn

source: Synnyin 5.11.1990 Rovaniemellä.
smn: Mun lam šoddâm 5.11.1990 Ruávinjaargâst.

source: Olen syntymästäni asti asunut saamelaisalueen ulkopuolella.
smn: Ton rääjist lam aassâm sämikuávlu ulguubeln.

source: Kotonamme on kuitenkin aina puhuttu ŠkotikielenäŠ pohjoissaamea, joten olen osannut kielen niin pitkään kuin vain muistan.
smn: Mii pääihist láá kuittâg ovttuu sárnum ŠpäikkikiellânŠ tavesämikielâ, et lam máttám kielâ nuuvt kuhe ko peri muštám.

source: Lisäksi olen saanut saamen kielen opetusta peruskoulussa.
smn: Lasseen lam finnim sämikielâ máttááttâs vuáđuškoovlâst.

source: Muistan aina kuinka se oli hieman outoa kun oma äiti opetti ja antoi kotiläksyjä.
smn: Muštám ain ko tot lâi ucánjáhháá oomâs ko jieččân enni máttááttij já adelij päikkiliävsuid.

source: Minulle saamelaisuus merkitsee paljon.
smn: Munjin sämmilâšvuotâ meerjhâš ennuv.

source: Pidän gáktia mieluummin kuin tummaa pukua, sillä gákti on mukavampi, komeampi ja ennen kaikkea se kertoo mistä sukuni tulee ja mitä olen.
smn: Kiävtám mááccuh mielâstubbooht ko čapis lädikáárvu, ko mááccuh lii vuohâsub, muččâdup já mii lii tehálâš, tot muštâl kost muu suuhâ puátá já mii mun lam.

source: Olen myös mieltänyt itseni enemmän saamelaiseksi kuin suomalaiseksi.
smn: Lam meiddei annaam jieččân eenâb sämmilâžžân ko syemmilâžžân.

source: Saamelaisuus on aina ollut hyvin vahvana perheemme arjessa vaikka saamea on voinut puhua vain kotona, serkkujen kanssa ja áhkulassa.
smn: Sämmilâšvuotâ lii ovttuu lamaš uáli nanos mii perruu argâpeeivist veikkâ sämikielâ sárnum lâi máhđulâš tuše pääihist, uárbimpelijguin, viljâpelijguin já ááhu lunne.

source: Pyrin opiskelemaan Oulun lääketieteelliseen, sillä lääkärin ammatti on ollut haaveeni yläasteelta asti.
smn: Iiskâm peessâđ luuhâđ Oulu talhâstieđâlâš tieđâkoodán, ko tuáhtár áámmát lii lamaš muu peivinaaveer pajetääsi rääjist.

source: Toivon myös, että voisin tulevaisuudessa yhdistää saamen kielen myös työhöni.
smn: Tuáivum meiddei, et puávtáččim puátteevuđâst ovtâstittiđ sämikielâ meid jieččân paargon.

source: Olen iloinen, että osaan saamen kielen ja voin käyttää sitä vapaasti aina kun haluan.
smn: Lam iiloost, et máátám sämikielâ já puávtám kevttiđ tom rijjâ kuás peri halijdâm.

source: Tahtoisin saada tämän saman tunteen ja vapauden myös jälkipolville, asuivat he saamelaisalueella tai sen ulkopuolella.
smn: Halijdiččim sirdeđ taam siämmáá tobdo já rijjâvuođâ meiddei puáttee puolváid, assiiba sij sämikuávlust tâi ton ulguubeln.
